# Pandas Data Analysis_Worksheet

##### Aim : List down the steps to install data frame and perform basic data exploratory analysis and cleaning using Pandas library in Python.

[1. Library Imports](#1-library-imports) <br>
[2. Data Acquistion using pd.read](#2-data-acquisition-using-pdread_) <br>
[3. Preliminary Data Inspection](#3-preliminary-data-inspection)

## 1. Library Imports

In [14]:
import pandas as pd
import numpy as np

# Set options for better output display in Jupyter Notebook
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 10)

In [15]:
data = {
    'CustomerID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Age': [28, 45, np.nan, 33, 50, 22, 41, 60, 35, 29],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'Income (TL)': [55000, 78000, 42000, 65000, 95000, 31000, 72000, 120000, 60000, np.nan],
    'City': ['Istanbul', 'Ankara', 'Izmir', 'Istanbul', 'Izmir', 'Ankara', 'Istanbul', 'Bursa', 'Izmir', 'Istanbul'],
    'Status': ['Active', 'Active', 'Passive', 'Active', 'Active', 'Active', 'Passive', 'Active', 'Active', 'Passive']
}

df = pd.DataFrame(data)

## 2. Data Acquisition using "pd.read_..."

In [16]:
# df_csv = pd.read_csv('filepath.csv')                    #Reads data from csv

# df_excel = pd.read_excel('filepath.xlsx')               #Reads data from excel

# df_json = pd.read_json('filepath.json')                 #Reads data from json

# df_sql = pd.read_sql('SELECT * FROM table', connection) #Reads data from sql

## 3. Preliminary Data Inspection

In [17]:
df.head() # Displays the first 5 rows of the DataFrame

   CustomerID   Age  Gender  Income (TL)      City   Status
0         101  28.0    Male      55000.0  Istanbul   Active
1         102  45.0  Female      78000.0    Ankara   Active
2         103   NaN    Male      42000.0     Izmir  Passive
3         104  33.0  Female      65000.0  Istanbul   Active
4         105  50.0    Male      95000.0     Izmir   Active

In [18]:
df.shape

(10, 6)

In [20]:
(df.columns) # Lists all column names in the DataFrame

Index(['CustomerID', 'Age', 'Gender', 'Income (TL)', 'City', 'Status'], dtype='object')

In [19]:
df.info() # Shows the data type and non-null count for each column. Provides a concise summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerID   10 non-null     int64
 1   Age          9 non-null      float64
 2   Gender       10 non-null     object
 3   Income (TL)  9 non-null      float64
 4   City         10 non-null     object
 5   Status       10 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes

In [21]:
df.describe() # Generates descriptive statistics for numerical columns in the DataFrame

       CustomerID        Age    Income (TL)
count    10.00000   9.000000       9.000000
mean    105.50000  38.111111   68666.666667
std       3.02765  12.025436   27000.000000
min     101.00000  22.000000   31000.000000
25%     103.25000  29.000000   55000.000000
50%     105.50000  35.000000   65000.000000
75%     107.75000  45.000000   78000.000000
max     110.00000  60.000000  120000.000000

In [13]:
df.describe(include=['object'])

       Gender      City  Status
count      10        10      10
unique      2         4       2
top      Male  Istanbul  Active
freq        6         4       7